ADT_clone/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.5 -1.2 -1.5)
    ( 1.5 -1.2 -1.5)
    ( 1.5  1.3 -1.5)
    (-1.5  1.3 -1.5)
    (-1.5 -1.2  1.5)
    ( 1.5 -1.2  1.5)
    ( 1.5  1.3  1.5)
    (-1.5  1.3  1.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);

// ************************************************************************* //
