ADT_clone/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
{
    {
        name              AMI1;
        patchInfo
        {
            type              cyclicAMI;
            matchTolerance    0.0001;
            neighbourPatch    AMI2;
            transform         noOrdering;
        }
        constructFrom patches;
        patches ("rotating_region.stl");
    }
    
    {
        name              AMI2;
        patchInfo
        {
            type              cyclicAMI;
            matchTolerance    0.0001;
            neighbourPatch    AMI1;
            transform         noOrdering;
        }
        constructFrom patches;
        patches ("rotating_region.stl");
    }
};


// ************************************************************************* //
