ADT_clone/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        cacheAgglomeration no;
        maxIter         500;

        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        $p;

        tolerance       1e-6;
        relTol          0;
    }

    "pcorr.*"
    {
        $p;

        tolerance       1e-2;
        relTol          0;

    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;
    pRefValue           0;
    pRefCell            0;
}

relaxationFactors
{
    P         0.1;
    U         0.1;
    k         0.1;
    epsilon   0.1;
}

cache
{
    grad(U);
}

// ************************************************************************* //
